Tekla Open API Reference for Tekla Structures 2025
WpfMeshCatalog Events
The WpfMeshCatalog type exposes the following members.
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
WpfMeshCatalog Class
Tekla.Structures.Dialog.UIControls Namespace